# Pandas

In [1]:
# What is Pandas
# What is a Series
# Attributes on a Series
# What is a Dataframe
# Creating a dataframe
# Attributes on a Dataframe
# Importing a CSV and Excel file
# Functions on a dataframe
# Data Filteration (gropupby, merge, pivot table)
# Data Transformation

# Pandas

In [2]:
# - It stands for Panel Data.
# - Pandas is a Python library that is used for data manipulation like Excel

In [4]:
# In Pandas we works upon two types of objects
# - 1- Series
# - 2- Dataframe

In [7]:
import pandas as pd

# Version

In [9]:
pd.__version__

'1.5.3'

In [11]:
import numpy as np

# Series

In [6]:
# - It is like a 1-D array structure.
# - A Series can be considered as a column from a table like Excel table
# - A Series does not have any header.
# - When we print a Series, it shows indexes and values

# How to create a Series

In [10]:
# pd.Series(array/list/tuple/dictionary...etc.)

# Creating a Series from a list

In [13]:
lst=[10,20,30,40,50]

num_s=pd.Series(lst)
num_s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [14]:
print(type(num_s))

<class 'pandas.core.series.Series'>

In [16]:
lst=['Tanmay','Sanjay','Ambika','Ebi','Prajakta']

names=pd.Series(lst)
print(names,type(names))

0      Tanmay
1      Sanjay
2      Ambika
3         Ebi
4    Prajakta
dtype: object <class 'pandas.core.series.Series'>

# Creating a Series using Dictionary

In [17]:
# - When we pass a dictionary to pd.Series() then 
# - The keys of the dictionary become the indexes and the values of the dictionary become the values in the Series

In [19]:
d={'Name':'Shreya','Age':22,'City':'Pune',"Company":'Infosys'}
d

{'Name': 'Shreya', 'Age': 22, 'City': 'Pune', 'Company': 'Infosys'}

In [21]:
emp=pd.Series(d)
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
dtype: object

In [22]:
print(type(emp))

<class 'pandas.core.series.Series'>

# Attributes on  a Series

In [23]:
# index
# values
# size
# shape
# ndim
# dtype
# name

### index

In [24]:
# - In Series we have two types of indexes.
# - The first are the implicit indexes (Python defined)
# - The second are the explicit indexes (User defined) also known as labels

# - In case of implicit indexes, the index attribute returns RangeIndex object that contains the start and stop.
# - In case of explicit indexes, the index attribute returns the Index object that contsins a list of indxees

In [25]:
num_s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [26]:
num_s.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
dtype: object

In [28]:
emp.index

Index(['Name', 'Age', 'City', 'Company'], dtype='object')

### values

In [29]:
# - It returns an array that contsins the values of the Series.

In [30]:
num_s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [31]:
num_s.values

array([10, 20, 30, 40, 50], dtype=int64)

In [32]:
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
dtype: object

In [33]:
emp.values

array(['Shreya', 22, 'Pune', 'Infosys'], dtype=object)

### dtype

In [34]:
# - It retrurns the data type of the elements that the Series contains.

In [35]:
num_s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [36]:
num_s.dtype

dtype('int64')

In [37]:
num_s=pd.Series([1,2,3.5,4,5])
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    5.0
dtype: float64

In [38]:
num_s.dtype

dtype('float64')

In [39]:
num_s=pd.Series([1,2,3.5+5j,4,5])
num_s

0    1.0+0.0j
1    2.0+0.0j
2    3.5+5.0j
3    4.0+0.0j
4    5.0+0.0j
dtype: complex128

In [40]:
num_s.dtype

dtype('complex128')

In [41]:
num_s=pd.Series([1,2,3.5,'4',5])
num_s

0      1
1      2
2    3.5
3      4
4      5
dtype: object

In [42]:
num_s.dtype

dtype('O')

In [45]:
num_s=pd.Series([1,2,True,3.5,4,5])
num_s

0       1
1       2
2    True
3     3.5
4       4
5       5
dtype: object

In [46]:
num_s.dtype

dtype('O')

In [47]:
num_s=pd.Series([1,2,3.5,4,None,5])
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    NaN
5    5.0
dtype: float64

In [48]:
num_s.dtype

dtype('float64')

In [43]:
# Numeric- int, float, complex
# Non-Numeric- Object

### size

In [49]:
# - It returns the number of elements a Series contains

In [50]:
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    NaN
5    5.0
dtype: float64

In [51]:
num_s.size

6

In [52]:
len(num_s)

6

### ndim

In [54]:
# - It returns the dimension of a Series

In [55]:
num_s.ndim

1

### shape

In [56]:
# - It returns a tuple of single element.
# - That element represents the number of items in the Series

In [57]:
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    NaN
5    5.0
dtype: float64

In [58]:
num_s.shape

(6,)

In [59]:
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
dtype: object

In [60]:
emp.shape

(4,)

In [66]:
a=(5,)
print(type(a))

<class 'tuple'>

In [75]:
a=2,
print(a,type(a))

(2,) <class 'tuple'>

## name

In [76]:
# A Series can be named using the name attribute

In [77]:
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    NaN
5    5.0
dtype: float64

In [78]:
num_s.name='My Series'

In [79]:
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    NaN
5    5.0
Name: My Series, dtype: float64

In [80]:
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
dtype: object

In [81]:
emp.name='Emp_Details'

In [82]:
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
Name: Emp_Details, dtype: object

In [83]:
emp.name

'Emp_Details'

In [84]:
num_s.name

'My Series'

# Indexing and Slicing of a Series

In [90]:
# To fetch an element on the basis of indexes we use 
# iloc and loc methods

# iloc stands for index locations.
# iloc is used with the implicit indexes.

# loc is used with the explicit indexes (labels)

In [91]:
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    NaN
5    5.0
Name: My Series, dtype: float64

In [99]:
# Fetch the first element

print(num_s.iloc[0])
print(num_s.iloc[-6])
print(num_s.iloc[-len(num_s)])

1.0
1.0
1.0

In [98]:
len(num_s)

6

In [102]:
# Fetch the last element

print(num_s.iloc[-1])
print(num_s.iloc[5])
print(num_s.iloc[len(num_s)-1])

5.0
5.0
5.0

In [103]:
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
Name: Emp_Details, dtype: object

In [111]:
# Fetch the first element

print(emp.iloc[0])
print(emp.loc['Name'])
print(emp.iloc[-4])

Shreya
Shreya
Shreya

# Slicing

In [112]:
num_s

0    1.0
1    2.0
2    3.5
3    4.0
4    NaN
5    5.0
Name: My Series, dtype: float64

In [113]:
num_s.iloc[0:3]

0    1.0
1    2.0
2    3.5
Name: My Series, dtype: float64

In [114]:
num_s.iloc[::-1]

5    5.0
4    NaN
3    4.0
2    3.5
1    2.0
0    1.0
Name: My Series, dtype: float64

In [115]:
emp

Name        Shreya
Age             22
City          Pune
Company    Infosys
Name: Emp_Details, dtype: object

In [117]:
emp.iloc[0:3]

Name    Shreya
Age         22
City      Pune
Name: Emp_Details, dtype: object

In [118]:
emp.loc['Name':'City']

Name    Shreya
Age         22
City      Pune
Name: Emp_Details, dtype: object

In [119]:
emp.iloc[::-1]

Company    Infosys
City          Pune
Age             22
Name        Shreya
Name: Emp_Details, dtype: object

In [121]:
emp.loc['Company':'Name':-1]

Company    Infosys
City          Pune
Age             22
Name        Shreya
Name: Emp_Details, dtype: object

In [122]:
emp.loc[::-1]

Company    Infosys
City          Pune
Age             22
Name        Shreya
Name: Emp_Details, dtype: object

In [125]:
nums=pd.Series([i for i in range(100,1001,100)],index=list('abcdefghij'))
nums

a     100
b     200
c     300
d     400
e     500
f     600
g     700
h     800
i     900
j    1000
dtype: int64

In [127]:
nums=pd.Series([i for i in range(100,1001,100)])
nums

0     100
1     200
2     300
3     400
4     500
5     600
6     700
7     800
8     900
9    1000
dtype: int64

In [129]:
nums.index=list('abcdefghij')

In [130]:
nums

a     100
b     200
c     300
d     400
e     500
f     600
g     700
h     800
i     900
j    1000
dtype: int64

In [133]:
names=['Tanmay', 'Sanjay', 'Ambika', 'Ebi', 'Prajakta','Vishal','Yatin','Natraj']
names

['Tanmay', 'Sanjay', 'Ambika', 'Ebi', 'Prajakta', 'Vishal', 'Yatin', 'Natraj']

In [135]:
emp=pd.Series(names)
emp

0      Tanmay
1      Sanjay
2      Ambika
3         Ebi
4    Prajakta
5      Vishal
6       Yatin
7      Natraj
dtype: object

In [143]:
emp.index=['emp_'+str(i) for i in range(1,len(emp)+1)]

In [144]:
emp

emp_1      Tanmay
emp_2      Sanjay
emp_3      Ambika
emp_4         Ebi
emp_5    Prajakta
emp_6      Vishal
emp_7       Yatin
emp_8      Natraj
dtype: object

In [146]:
emp.loc['emp_1':'emp_5':2]

emp_1      Tanmay
emp_3      Ambika
emp_5    Prajakta
dtype: object

In [153]:
d={'emp_1':{'Name':'Sanjay','Age':22},
'emp_2':{'Name':'Natraj','Age':25}}
d

{'emp_1': {'Name': 'Sanjay', 'Age': 22},
 'emp_2': {'Name': 'Natraj', 'Age': 25}}

In [154]:
s=pd.Series(d)
s

emp_1    {'Name': 'Sanjay', 'Age': 22}
emp_2    {'Name': 'Natraj', 'Age': 25}
dtype: object

In [157]:
s.loc['emp_2']['Age']

25

In [159]:
pd.DataFrame(d).T

         Name Age
emp_1  Sanjay  22
emp_2  Natraj  25

# Dataframe

In [148]:
# - A dataframe is a 2-D structure.
# - It can be considered as a table from Excel.
# - It is the combination of rows and columns.
# - A dataframe has headers for all the columns.

# Creating a dataframe

In [160]:
# pd.DataFrame(List/Dictionary/Series...etc.)

# Using Lists

In [171]:
names=['Tanmay', 'Sanjay', 'Ambika', 'Ebi', 'Prajakta','Vishal','Yatin','Natraj']
age=[25,24,28,22,26,31,25,36]
city=['Pune','Bangalore','Chennai','Dehradun','Mumbai','Pune','Chandigarh','Delhi']

In [174]:
pd.DataFrame([names,age,city])

        0          1        2         3         4       5           6       7
0  Tanmay     Sanjay   Ambika       Ebi  Prajakta  Vishal       Yatin  Natraj
1      25         24       28        22        26      31          25      36
2    Pune  Bangalore  Chennai  Dehradun    Mumbai    Pune  Chandigarh   Delhi

In [177]:
df=pd.DataFrame([names,age,city]).T
df

          0   1           2
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [178]:
df.columns=['Name','Age','City']

In [179]:
df

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

# Using 2-D list

In [180]:
[['Tanmay',25,'Pune'],['Sanjay',24,'Bangalore'],['Ambika',28,'Chennai']]

[['Tanmay', 25, 'Pune'],
 ['Sanjay', 24, 'Bangalore'],
 ['Ambika', 28, 'Chennai']]

In [186]:
pd.DataFrame([['Tanmay',25,'Pune'],['Sanjay',24,'Bangalore'],['Ambika',28,'Chennai']],columns=['Name','Age','City'])

     Name  Age       City
0  Tanmay   25       Pune
1  Sanjay   24  Bangalore
2  Ambika   28    Chennai

# Using Series

In [188]:
nsr=pd.Series(names)
asr=pd.Series(age)
csr=pd.Series(city)

In [189]:
nsr

0      Tanmay
1      Sanjay
2      Ambika
3         Ebi
4    Prajakta
5      Vishal
6       Yatin
7      Natraj
dtype: object

In [190]:
asr

0    25
1    24
2    28
3    22
4    26
5    31
6    25
7    36
dtype: int64

In [191]:
csr

0          Pune
1     Bangalore
2       Chennai
3      Dehradun
4        Mumbai
5          Pune
6    Chandigarh
7         Delhi
dtype: object

In [195]:
df=pd.DataFrame([nsr,asr,csr]).T
df

          0   1           2
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [196]:
df.columns=['Name','Age','City']

In [197]:
df

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [199]:
nsr.name='Name'
asr.name='Age'
csr.name='City'

In [203]:
df=pd.DataFrame([nsr,asr,csr]).T
df

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

# Using dictionary

In [204]:
# - The keys from the dictionary becomes the column names

In [210]:
d={'Emp_Name':names,'Emp_Age':age,'Emp_City':city}
d

{'Emp_Name': ['Tanmay',
  'Sanjay',
  'Ambika',
  'Ebi',
  'Prajakta',
  'Vishal',
  'Yatin',
  'Natraj'],
 'Emp_Age': [25, 24, 28, 22, 26, 31, 25, 36],
 'Emp_City': ['Pune',
  'Bangalore',
  'Chennai',
  'Dehradun',
  'Mumbai',
  'Pune',
  'Chandigarh',
  'Delhi']}

In [211]:
pd.DataFrame(d)

   Emp_Name  Emp_Age    Emp_City
0    Tanmay       25        Pune
1    Sanjay       24   Bangalore
2    Ambika       28     Chennai
3       Ebi       22    Dehradun
4  Prajakta       26      Mumbai
5    Vishal       31        Pune
6     Yatin       25  Chandigarh
7    Natraj       36       Delhi

# Using Nested Dictionary

In [215]:
emp={
    'emp_1':{'Name':'Yatin',
             'Age':25,
             'City':'Pune'},
    
    'emp_2':{'Name':'Piyush',
             'Age':28,
             'City':'Delhi'},
    
    'emp_3':{'Name':'Akshay',
             'Age':27,
             'City':'Dehradun'}
    
    }
print(emp)

{'emp_1': {'Name': 'Yatin', 'Age': 25, 'City': 'Pune'}, 'emp_2': {'Name': 'Piyush', 'Age': 28, 'City': 'Delhi'}, 'emp_3': {'Name': 'Akshay', 'Age': 27, 'City': 'Dehradun'}}

In [216]:
emp

{'emp_1': {'Name': 'Yatin', 'Age': 25, 'City': 'Pune'},
 'emp_2': {'Name': 'Piyush', 'Age': 28, 'City': 'Delhi'},
 'emp_3': {'Name': 'Akshay', 'Age': 27, 'City': 'Dehradun'}}

In [219]:
df=pd.DataFrame(emp).T
df

         Name Age      City
emp_1   Yatin  25      Pune
emp_2  Piyush  28     Delhi
emp_3  Akshay  27  Dehradun

# Indexing and Slicng

# Indexing

In [220]:
# We have row indexes and column indexes

In [221]:
# df.iloc[row_index]
# df.iloc[row_index,col_index]

# df.loc[row_index]
# df.loc[row_index,col_index]

In [222]:
df

         Name Age      City
emp_1   Yatin  25      Pune
emp_2  Piyush  28     Delhi
emp_3  Akshay  27  Dehradun

In [223]:
df_1=pd.DataFrame([nsr,asr,csr]).T
df_1

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [225]:
# Fetch the first row

df_1.iloc[[0]]

     Name Age  City
0  Tanmay  25  Pune

In [233]:
df_1.iloc[[-8]]

     Name Age  City
0  Tanmay  25  Pune

In [234]:
df_1

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [236]:
# Fetch the name from the third row

df_1.iloc[2,0]

'Ambika'

In [238]:
# Fetch the city from the fifth row

df_1.iloc[4,-1]

'Mumbai'

In [239]:
df_1.iloc[4,2]

'Mumbai'

In [241]:
# Fetch the name from the third row

df_1.loc[2,'Name']

'Ambika'

In [242]:
# Fetch the city from the fifth row

df_1.loc[4,'City']

'Mumbai'

In [243]:
# In the 6th row change the city to Madurai

In [244]:
df_1

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31        Pune
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [247]:
df_1.loc[5,'City']='Madurai'

In [248]:
df_1

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3       Ebi  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31     Madurai
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [249]:
# In the 4th row change the name to Nimisha

In [252]:
df_1.loc[3,'Name']='Nimisha'

In [253]:
df_1

       Name Age        City
0    Tanmay  25        Pune
1    Sanjay  24   Bangalore
2    Ambika  28     Chennai
3   Nimisha  22    Dehradun
4  Prajakta  26      Mumbai
5    Vishal  31     Madurai
6     Yatin  25  Chandigarh
7    Natraj  36       Delhi

In [254]:
df

         Name Age      City
emp_1   Yatin  25      Pune
emp_2  Piyush  28     Delhi
emp_3  Akshay  27  Dehradun

In [255]:
# Fetch the details of emp_3

In [257]:
df.loc[['emp_3']]

         Name Age      City
emp_3  Akshay  27  Dehradun

In [258]:
# Change the name of emp_2 to Vishal

In [261]:
df.loc['emp_2','Name']='Vishal'

In [262]:
df

         Name Age      City
emp_1   Yatin  25      Pune
emp_2  Vishal  28     Delhi
emp_3  Akshay  27  Dehradun

In [263]:
# Change the Age of emp_1 to 32

In [266]:
df.loc['emp_1','Age']=32

In [267]:
df

         Name Age      City
emp_1   Yatin  32      Pune
emp_2  Vishal  28     Delhi
emp_3  Akshay  27  Dehradun

In [270]:
pd.DataFrame({'Age':[10,20,30,40],'Age':[1,2,3,4]})

   Age
0    1
1    2
2    3
3    4